#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=1f54fcb211ef2502758c012188bb9cd8d499b374]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.s3_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
data.aws_route53_zone.domain_zone: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/e59eefc9-84b9-4b76-acb4-db2381e7cf5e]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.cloudfront_waf[0].aws_wafv2_web_acl.web_acl: Refreshing state... [id=2793631e-acb7-488e-b869-0550debb116b]
module.s3_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"]: Refreshing state... [id=lambda_zip/layer/utility_zip_file]
module.s3_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla-website-prod,private]
module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:836049003243:layer:mulla-website-prod-utility:4]
data.aws_route53_zone.domain_zone: Read complete after 1s [id=Z019756110G25DTYU8A62]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-06-24 00:46:18.929 +0000 UTC]
module.api.aws_iam_role.api_role: Refreshing state... [id=mulla-website-prod-api-role]
module.api.module.contact.data.archive_file.lambda_source_package: Reading...
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Reading...
module.api.aws_iam_role.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Read complete after 0s [id=1803c486c0dc93154a6c0af2b29290e1a70839d2]
module.api.module.contact.data.archive_file.lambda_source_package: Read complete after 0s [id=8138c74d9276518443ade5431aa3b72570054adf]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=zru2i4hwj8]
module.api.module.contact.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/contact]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Reading...
module.api.module.contact.module.contact_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2576865068]
module.api.module.contact.module.contact_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.contact.module.contact_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-inline]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.contact.module.contact_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.aws_cloudwatch_log_group.api_gateway_execution_logs: Refreshing state... [id=API-Gateway-Execution-Logs_zru2i4hwj8/production]
module.api.aws_api_gateway_resource.contact: Refreshing state... [id=sb4ywj]
module.api.aws_api_gateway_account.api_cloudwatch_role: Refreshing state... [id=api-gateway-account]
module.api.aws_iam_role_policy.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role:mulla-website-prod-cloudwatch-policy]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=779959300]
module.api.module.contact.module.contact_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-logs]
module.api.module.contact.aws_api_gateway_method.contact: Refreshing state... [id=agm-zru2i4hwj8-sb4ywj-POST]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-contact-20230622115444781600000002]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-contact-20230622115444951400000003]
module.api.module.contact.module.contact_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.contact.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.module.contact.aws_api_gateway_integration.contact_lambda_integration: Refreshing state... [id=agi-zru2i4hwj8-sb4ywj-POST]
module.api.aws_api_gateway_deployment.api_deploy: Refreshing state... [id=nrgb1v]
module.api.aws_api_gateway_stage.apigw_stage: Refreshing state... [id=ags-zru2i4hwj8-prod]
module.api.aws_api_gateway_method_settings.apigw_setting: Refreshing state... [id=zru2i4hwj8-prod-*/*]
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=mulla-website-prod-remove-path]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3OY4E9ZUA5801]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3SZYF84PQNNM0]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]
module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption: Refreshing state... [id=mulla-website-prod]
module.website.aws_s3_bucket_policy.access: Refreshing state... [id=mulla-website-prod]
module.website.aws_s3_object.images["cevo-logo.webp"]: Refreshing state... [id=images/cevo-logo.webp]
module.website.aws_s3_object.images["rmit-online-logo.webp"]: Refreshing state... [id=images/rmit-online-logo.webp]
module.website.aws_s3_object.images["compuleader-logo.webp"]: Refreshing state... [id=images/compuleader-logo.webp]
module.website.aws_s3_object.images["banner.webp"]: Refreshing state... [id=images/banner.webp]
module.website.aws_s3_object.images["iress.webp"]: Refreshing state... [id=images/iress.webp]
module.website.aws_s3_object.images["ciandt-logo.webp"]: Refreshing state... [id=images/ciandt-logo.webp]
module.website.aws_s3_object.images["tbb.webp"]: Refreshing state... [id=images/tbb.webp]
module.website.aws_s3_object.images["portfolio.webp"]: Refreshing state... [id=images/portfolio.webp]
module.website.aws_s3_object.images["rmit-logo.webp"]: Refreshing state... [id=images/rmit-logo.webp]
module.website.aws_s3_object.images["ehealth.webp"]: Refreshing state... [id=images/ehealth.webp]
module.website.aws_s3_object.images["tishreen-university-logo.webp"]: Refreshing state... [id=images/tishreen-university-logo.webp]
module.website.aws_s3_object.images["rmit.webp"]: Refreshing state... [id=images/rmit.webp]
module.website.aws_s3_object.images["iress-logo.webp"]: Refreshing state... [id=images/iress-logo.webp]
module.website.aws_s3_object.images["tarek-mulla.webp"]: Refreshing state... [id=images/tarek-mulla.webp]
module.website.aws_s3_object.images["telstra.webp"]: Refreshing state... [id=images/telstra.webp]
module.website.aws_s3_object.static_files["sitemap.xml"]: Refreshing state... [id=website/sitemap.xml]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css"]: Refreshing state... [id=website/static/css/main.b8644671.css]
module.website.aws_s3_object.static_files["static/js/main.f870bc12.js"]: Refreshing state... [id=website/static/js/main.f870bc12.js]
module.website.aws_s3_object.static_files["favicon.ico"]: Refreshing state... [id=website/favicon.ico]
module.website.aws_s3_object.static_files["asset-manifest.json"]: Refreshing state... [id=website/asset-manifest.json]
module.website.aws_s3_object.static_files["static/js/main.f870bc12.js.map"]: Refreshing state... [id=website/static/js/main.f870bc12.js.map]
module.website.aws_s3_object.static_files["robots.txt"]: Refreshing state... [id=website/robots.txt]
module.website.aws_s3_object.static_files["index.html"]: Refreshing state... [id=website/index.html]
module.website.aws_s3_object.static_files["static/js/496.767d96d0.chunk.js.map"]: Refreshing state... [id=website/static/js/496.767d96d0.chunk.js.map]
module.website.aws_s3_object.static_files["static/js/496.767d96d0.chunk.js"]: Refreshing state... [id=website/static/js/496.767d96d0.chunk.js]
module.website.aws_s3_object.static_files["static/js/main.f870bc12.js.LICENSE.txt"]: Refreshing state... [id=website/static/js/main.f870bc12.js.LICENSE.txt]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css.map"]: Refreshing state... [id=website/static/css/main.b8644671.css.map]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_api_gateway_account.api_cloudwatch_role will be updated in-place
  ~ resource "aws_api_gateway_account" "api_cloudwatch_role" {
      ~ cloudwatch_role_arn = "arn:aws:iam::836049003243:role/mulla-website-dev-api-cloudwatch-role" -> "arn:aws:iam::836049003243:role/mulla-website-prod-api-cloudwatch-role"
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # module.website.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.website.data.aws_iam_policy_document.website_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "website_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::mulla-website-prod/*",
            ]
          + sid       = "Allow cloudfront OAC to access S3"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::836049003243:distribution/E3SZYF84PQNNM0",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.website.aws_s3_bucket_policy.access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access" {
        id     = "mulla-website-prod"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::836049003243:distribution/E3SZYF84PQNNM0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::mulla-website-prod/*"
                      - Sid       = "Allow cloudfront OAC to access S3"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/asset-manifest.json"
      ~ source_hash            = "f4cab9c9801c91cb75bbf403a742e6a1" -> "922ea4f598f11ba8919729233db4ab78"
        tags                   = {}
      ~ version_id             = "CjErL3erx83J8u_uSkXl8EOBkz1cQEww" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/index.html"
      ~ source_hash            = "314939f6d84461b0ef32b71350d80ac4" -> "f96290f61f11f173208ed38820807de4"
        tags                   = {}
      ~ version_id             = "_Aijd4ho2FZ1jEsL3OD6A36m_v4QV2t9" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.1bda593c.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.1bda593c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.1bda593c.js"
      + source_hash            = "18fcd21d209cb849f596db6b2505104d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.1bda593c.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.1bda593c.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.1bda593c.js.LICENSE.txt"
      + source_hash            = "ad574122e8d86a1666a1ca6da504d7a4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.1bda593c.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.1bda593c.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.1bda593c.js.map"
      + source_hash            = "7a3ac28d7fd1fc89063d674d9d94530c"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.f870bc12.js"] will be destroyed
  # (because key ["static/js/main.f870bc12.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "898d2d2cfdb74eaca1e09f3af0f1f77c" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.f870bc12.js" -> null
      - key                    = "website/static/js/main.f870bc12.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.f870bc12.js" -> null
      - source_hash            = "898d2d2cfdb74eaca1e09f3af0f1f77c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Z5YyWLHP2YYPxIF239Ia_J.5HSxkkwAY" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.f870bc12.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.f870bc12.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.f870bc12.js.LICENSE.txt" -> null
      - key                    = "website/static/js/main.f870bc12.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.f870bc12.js.LICENSE.txt" -> null
      - source_hash            = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "cvWjrVwEgPXbr5dbn1DKh5eFiszBVW7C" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.f870bc12.js.map"] will be destroyed
  # (because key ["static/js/main.f870bc12.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "4cf94aad0f4de8397880c6598927aff9" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.f870bc12.js.map" -> null
      - key                    = "website/static/js/main.f870bc12.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.f870bc12.js.map" -> null
      - source_hash            = "4cf94aad0f4de8397880c6598927aff9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "KRL7n1l.c7pKtsh56g9X_ABQjYN2XgtA" -> null
    }

  # module.api.module.api_authorizer.aws_api_gateway_authorizer.lambda_authorizer will be created
  + resource "aws_api_gateway_authorizer" "lambda_authorizer" {
      + arn                              = (known after apply)
      + authorizer_credentials           = "arn:aws:iam::836049003243:role/mulla-website-prod-api-role"
      + authorizer_result_ttl_in_seconds = 0
      + authorizer_uri                   = (known after apply)
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.x-api-key"
      + name                             = "lambda_authorizer"
      + rest_api_id                      = "zru2i4hwj8"
      + type                             = "TOKEN"
    }

  # module.api.module.api_authorizer.aws_lambda_permission.lambda_permession will be created
  + resource "aws_lambda_permission" "lambda_permession" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "mulla-website-prod-authorizer"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:836049003243:zru2i4hwj8/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.module.api_authorizer.aws_s3_object.lambda_code_zip will be created
  + resource "aws_s3_object" "lambda_code_zip" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "c33ffce4dcd40f8bf6c3d957b47a92f2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda_zip/function/authorizer"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../.tmp/authorizer.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api.module.api_authorizer.aws_ssm_parameter.api_auth_token_ssm will be created
  + resource "aws_ssm_parameter" "api_auth_token_ssm" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "mulla-website/prod/api_auth_token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api.module.api_authorizer.random_password.api_auth_token will be created
  + resource "random_password" "api_auth_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 50
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.api.module.contact.aws_api_gateway_method.contact will be updated in-place
  ~ resource "aws_api_gateway_method" "contact" {
      + authorizer_id        = (known after apply)
        id                   = "agm-zru2i4hwj8-sb4ywj-POST"
        # (8 unchanged attributes hidden)
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "mulla-website/prod/*",
            ]
          + sid       = "ses"
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/mulla-website-prod-authorizer"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all          = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "mulla-website-prod-authorizer-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "mulla-website-prod-authorizer-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mulla-website-prod-authorizer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all              = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + unique_id             = (known after apply)
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mulla-website-prod-authorizer"
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mulla-website-prod-authorizer"
    }

  # module.api.module.api_authorizer.module.authorizer_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "lambda function to authorize the app invocation"
      + function_name                  = "mulla-website-prod-authorizer"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "mulla-website-prod"
      + s3_key                         = (known after apply)
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all                       = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "APP" = "mulla-website"
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage {
          + size = 512
        }
    }

Plan: 15 to add, 5 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*